app/Controllers/Buku.php

    public function index()
    {
        $data['buku'] = $this->bukuModel->findAll();
---
SELECT *
FROM `buku`