app/Controllers/Pengunjung.php

    public function buku()
    {
        $data['buku'] = $this->bukuModel->findAll();
---
SELECT *
FROM `buku`

    public function history()
    {
        $data['pinjam'] = $this->pinjamModel
            ->where('user_id', session()->get('user_id'))
            ->join('buku', 'buku.id = peminjaman.buku_id')
            ->select('peminjaman.*, buku.judul, buku.gambar, buku.deskripsi, buku.rating, buku.penulis, buku.tahun_terbit')
            ->orderBy('peminjaman.id', 'DESC')
            ->findAll();
---
SELECT `peminjaman`.*, `buku`.`judul`, `buku`.`gambar`, `buku`.`deskripsi`, `buku`.`rating`, `buku`.`penulis`, `buku`.`tahun_terbit`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id` = `peminjaman`.`buku_id`
WHERE `user_id` = '6'
ORDER BY `peminjaman`.`id` DESC