app/Controllers/User.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
---
    public function index()
    {
        $data['users'] = $this->userModel->findAll();