app/Models/PeminjamanModel.php

SELECT `peminjaman`.*, `users`.`nama` as `nama_user`, `buku`.`judul`, `buku`.`gambar`, `buku`.`deskripsi`, `buku`.`rating`, `buku`.`penulis`, `buku`.`tahun_terbit`
FROM `peminjaman`
JOIN `users` ON `users`.`id` = `peminjaman`.`user_id`
JOIN `buku` ON `buku`.`id` = `peminjaman`.`buku_id`
ORDER BY `peminjaman`.`id` DESC
---
    public function getAllWithRelasi()
    {
        return $this->select('peminjaman.*,
                            users.nama as nama_user,
                            buku.judul, buku.gambar, buku.deskripsi, buku.rating,
                            buku.penulis, buku.tahun_terbit')
                    ->join('users', 'users.id = peminjaman.user_id')
                    ->join('buku', 'buku.id = peminjaman.buku_id')
                    ->orderBy('peminjaman.id', 'DESC')
                    ->findAll();