app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'nara@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function findByEmail(string $email)
    {
        return $this->where('email', $email)->first();